Revit 2027 API
BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryMainSeparate Property
 Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary in the main model of the Revit link differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, and use room separation lines to divide the space in the main model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionConflictInLinkBoundariesVaryMainSeparate { get; }
Public Shared ReadOnly Property OptionConflictInLinkBoundariesVaryMainSeparate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionConflictInLinkBoundariesVaryMainSeparate {
	FailureDefinitionId^ get ();
}
static member OptionConflictInLinkBoundariesVaryMainSeparate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace